# Pandas

## Core Data Structures

In [1]:
import pandas as pd

In [3]:
#1.Series:

s1=[10,20,30,40,50,60]
series=pd.Series(s1)
print(series)

0    10
1    20
2    30
3    40
4    50
5    60
dtype: int64

In [4]:
print(series[1:2])

1    20
dtype: int64

In [5]:
print(series[1:])

1    20
2    30
3    40
4    50
5    60
dtype: int64

In [6]:
print(series[:3])

0    10
1    20
2    30
dtype: int64

In [8]:
#2.DataFrame

df=pd.DataFrame({'A':[1,2,3,4,56],
                  'B':[10,20,30,40,50]})

print(df)

    A   B
0   1  10
1   2  20
2   3  30
3   4  40
4  56  50

In [14]:
d1=[[10,20,30,40,50,60],[12,23,34,64,765,756]]
res=pd.DataFrame(d1)
print(res)

    0   1   2   3    4    5
0  10  20  30  40   50   60
1  12  23  34  64  765  756

In [15]:
d1=[[10,20,30,40,50,60],[12,23,34,64,765,756]]
colname= ['Col1', 'Col2', 'Col3', 'Col4', 'Col5', 'Col6']
res=pd.DataFrame(d1,columns=colname)
print(res)

   Col1  Col2  Col3  Col4  Col5  Col6
0    10    20    30    40    50    60
1    12    23    34    64   765   756

In [22]:
'''If you want to print a DataFrame vertically, 
where the rows become columns and the columns become rows,
you can use the .T attribute, which stands for "transpose."  '''

print(res.T)

       0    1
Col1  10   12
Col2  20   23
Col3  30   34
Col4  40   64
Col5  50  765
Col6  60  756

##Key Functions and Methods

In [31]:
#First How to create csv file from our data

d1 = [[10, 20, 30, 40, 50, 60], [12, 23, 34, 64, 765, 756]]
df=pd.DataFrame(d1)
 
res=df.to_csv('mydata.csv', index=False)

fetch_data=pd.read_csv('mydata.csv')
print(fetch_data)

    0   1   2   3    4    5
0  10  20  30  40   50   60
1  12  23  34  64  765  756

In [40]:
 
# Creating a DataFrame with specified columns and index
 
print(fetch_data)

columns = ['A', 'B', 'C','D','E','F']
index = ['Row1', 'Row2']

newdf=pd.DataFrame(fetch_data.values, columns=columns, index=index)
newdf

    0   1   2   3    4    5
0  10  20  30  40   50   60
1  12  23  34  64  765  756

       A   B   C   D    E    F
Row1  10  20  30  40   50   60
Row2  12  23  34  64  765  756

## Data Manipulation in Pandas

### Data Collecting

In [ ]:
# 1.Handling Missing Data:

df=pd.read_

In [45]:
 data={ 'ID': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    'Name': ['John Doe', 'Jane Smith', 'Emily Davis', 'Michael Brown', 'Michael Brown', 'Jessica Jones', 'Oliver Green', None, 'Liam White', 'Emma Black'],
    'Age': [28, None, 35, 28, 28, 29, 32, 30, 40, 28],
    'Salary': [50000, 55000, None, 50000, 50000, 60000, None, 65000, 70000, 65000],
    'Department': ['Engineering', 'Marketing', 'Finance', 'Engineering', 'Engineering', 'HR', 'Finance', 'Sales', 'Sales', None],
    'JoinDate': ['2020-01-15', '2021-05-22', '2020-11-11', '2020-01-15', '2020-01-15', '2022-03-10', None, '2021-08-30', '2019-12-01', '2020-06-21']
 }
    
print(data)

{'ID': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10], 'Name': ['John Doe', 'Jane Smith', 'Emily Davis', 'Michael Brown', 'Michael Brown', 'Jessica Jones', 'Oliver Green', None, 'Liam White', 'Emma Black'], 'Age': [28, None, 35, 28, 28, 29, 32, 30, 40, 28], 'Salary': [50000, 55000, None, 50000, 50000, 60000, None, 65000, 70000, 65000], 'Department': ['Engineering', 'Marketing', 'Finance', 'Engineering', 'Engineering', 'HR', 'Finance', 'Sales', 'Sales', None], 'JoinDate': ['2020-01-15', '2021-05-22', '2020-11-11', '2020-01-15', '2020-01-15', '2022-03-10', None, '2021-08-30', '2019-12-01', '2020-06-21']}

In [47]:
df=pd.DataFrame(data)
print(df)

   ID           Name   Age   Salary   Department    JoinDate
0   1       John Doe  28.0  50000.0  Engineering  2020-01-15
1   2     Jane Smith   NaN  55000.0    Marketing  2021-05-22
2   3    Emily Davis  35.0      NaN      Finance  2020-11-11
3   4  Michael Brown  28.0  50000.0  Engineering  2020-01-15
4   5  Michael Brown  28.0  50000.0  Engineering  2020-01-15
5   6  Jessica Jones  29.0  60000.0           HR  2022-03-10
6   7   Oliver Green  32.0      NaN      Finance        None
7   8           None  30.0  65000.0        Sales  2021-08-30
8   9     Liam White  40.0  70000.0        Sales  2019-12-01
9  10     Emma Black  28.0  65000.0         None  2020-06-21

In [78]:
df.to_csv('myrow_data.csv',index=False)
df

   ID           Name   Age   Salary   Department    JoinDate
0   1       John Doe  28.0  50000.0  Engineering  2020-01-15
1   2     Jane Smith   0.0  55000.0    Marketing  2021-05-22
2   3    Emily Davis  35.0      0.0      Finance  2020-11-11
3   4  Michael Brown  28.0  50000.0  Engineering  2020-01-15
4   5  Michael Brown  28.0  50000.0  Engineering  2020-01-15
5   6  Jessica Jones  29.0  60000.0           HR  2022-03-10
6   7   Oliver Green  32.0      0.0      Finance           0
7   8              0  30.0  65000.0        Sales  2021-08-30
8   9     Liam White  40.0  70000.0        Sales  2019-12-01
9  10     Emma Black  28.0  65000.0            0  2020-06-21

### Data Cleaning

#### 1 Handling Missing Value

In [60]:
#1. Identify Missing Values

df.isna().sum()

ID            0
Name          1
Age           1
Salary        2
Department    1
JoinDate      1
dtype: int64

In [58]:
df.isnull()

      ID   Name    Age  Salary  Department  JoinDate
0  False  False  False   False       False     False
1  False  False   True   False       False     False
2  False  False  False    True       False     False
3  False  False  False   False       False     False
4  False  False  False   False       False     False
5  False  False  False   False       False     False
6  False  False  False    True       False      True
7  False   True  False   False       False     False
8  False  False  False   False       False     False
9  False  False  False   False        True     False

#### 2 Fill Missing Values:

In [74]:
 #1 Fill with a Specific Value
df_filled= df.fillna(0)
print(df_filled)

   ID           Name   Age   Salary   Department    JoinDate
0   1       John Doe  28.0  50000.0  Engineering  2020-01-15
1   2     Jane Smith   0.0  55000.0    Marketing  2021-05-22
2   3    Emily Davis  35.0      0.0      Finance  2020-11-11
3   4  Michael Brown  28.0  50000.0  Engineering  2020-01-15
4   5  Michael Brown  28.0  50000.0  Engineering  2020-01-15
5   6  Jessica Jones  29.0  60000.0           HR  2022-03-10
6   7   Oliver Green  32.0      0.0      Finance           0
7   8              0  30.0  65000.0        Sales  2021-08-30
8   9     Liam White  40.0  70000.0        Sales  2019-12-01
9  10     Emma Black  28.0  65000.0            0  2020-06-21

   ID           Name   Age   Salary   Department    JoinDate
0   1       John Doe  28.0  50000.0  Engineering  2020-01-15
1   2     Jane Smith   0.0  55000.0    Marketing  2021-05-22
2   3    Emily Davis  35.0      0.0      Finance  2020-11-11
3   4  Michael Brown  28.0  50000.0  Engineering  2020-01-15
4   5  Michael Brown  28.0  50000.0  Engineering  2020-01-15
5   6  Jessica Jones  29.0  60000.0           HR  2022-03-10
6   7   Oliver Green  32.0      0.0      Finance           0
7   8              0  30.0  65000.0        Sales  2021-08-30
8   9     Liam White  40.0  70000.0        Sales  2019-12-01
9  10     Emma Black  28.0  65000.0            0  2020-06-21

In [86]:
 import numpy as np
# Sample DataFrame
df = pd.DataFrame({
    'A': [1, np.nan, 3, np.nan, 5],
    'B': [10, 20, np.nan, np.nan, 50]
})

print("Original DataFrame:")
print(df)

Original DataFrame:
     A     B
0  1.0  10.0
1  NaN  20.0
2  3.0   NaN
3  NaN   NaN
4  5.0  50.0

In [88]:
df_ffill = df.fillna(method='ffill')
df_ffill

     A     B
0  1.0  10.0
1  1.0  20.0
2  3.0  20.0
3  3.0  20.0
4  5.0  50.0

In [89]:
df_ffill = df.fillna(method='bfill')
df_ffill

     A     B
0  1.0  10.0
1  3.0  20.0
2  3.0  50.0
3  5.0  50.0
4  5.0  50.0

#### Drop Missing Values:

In [92]:
#Drop Rows with Any NaN Values

df.dropna()

     A     B
0  1.0  10.0
4  5.0  50.0

In [95]:
df

     A     B
0  1.0  10.0
1  NaN  20.0
2  3.0   NaN
3  NaN   NaN
4  5.0  50.0

In [94]:
#Drop Columns with Any NaN Values
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [98]:
#Drop Rows with Less Than n Non-NaN Values
df.dropna(thresh=2)

     A     B
0  1.0  10.0
4  5.0  50.0

In [100]:
#Drop Columns with Any NaN Values
df_dropped_columns = df.dropna(axis=1)  # Drop columns with any NaN values